#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

[command]/home/runner/work/_temp/d165b8e6-7b53-4bda-a386-1bd043c39181/terraform-bin show -no-color plan.tmp

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_s3_object.redirects[609] must be replaced
-/+ resource "aws_s3_object" "redirects" {
      ~ bucket_key_enabled     = false -> (known after apply)
      ~ etag                   = "d41d8cd98f00b204e9800998ecf8427e" -> (known after apply)
      ~ id                     = "/workflows/liquibase-community/generating-docs.html" -> (known after apply)
      ~ key                    = "/workflows/liquibase-community/generating-docs.html" -> "/workflows/liquibase-community/demo.html" # forces replacement
      + kms_key_id             = (known after apply)
      - metadata               = {} -> null
      ~ server_side_encryption = "AES256" -> (known after apply)
      ~ storage_class          = "STANDARD" -> (known after apply)
      - tags                   = {} -> null
      ~ tags_all               = {} -> (known after apply)
      ~ version_id             = "cm6QnEk_Z.da5uOQCYkWnaowgXirziHj" -> (known after apply)
      ~ website_redirect       = "/commands/change-tracking/db-doc.html" -> "/workflows/liquibase-community/automatic-custom-rollbacks.html"
        # (4 unchanged attributes hidden)
    }

  # aws_s3_object.redirects[610] will be created
  + resource "aws_s3_object" "redirects" {
      + acl                    = "private"
      + bucket                 = "stage-docsstageliquibasecom-origin"
      + bucket_key_enabled     = (known after apply)
      + content_type           = "text/html"
      + etag                   = (known after apply)
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "/workflows/liquibase-community/generating-docs.html"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
      + website_redirect       = "/commands/change-tracking/db-doc.html"
    }

Plan: 2 to add, 0 to change, 1 to destroy.
::debug::Terraform exited with code 0.
::debug::stdout: %0ATerraform used the selected providers to generate the following execution%0Aplan. Resource actions are indicated with the following symbols:%0A  + create%0A-/+ destroy and then create replacement%0A%0ATerraform will perform the following actions:%0A%0A  # aws_s3_object.redirects[609] must be replaced%0A-/+ resource "aws_s3_object" "redirects" {%0A      ~ bucket_key_enabled     = false -> (known after apply)%0A      ~ etag                   = "d41d8cd98f00b204e9800998ecf8427e" -> (known after apply)%0A      ~ id                     = "/workflows/liquibase-community/generating-docs.html" -> (known after apply)%0A      ~ key                    = "/workflows/liquibase-community/generating-docs.html" -> "/workflows/liquibase-community/demo.html" # forces replacement%0A      + kms_key_id             = (known after apply)%0A      - metadata               = {} -> null%0A      ~ server_side_encryption = "AES256" -> (known after apply)%0A      ~ storage_class          = "STANDARD" -> (known after apply)%0A      - tags                   = {} -> null%0A      ~ tags_all               = {} -> (known after apply)%0A      ~ version_id             = "cm6QnEk_Z.da5uOQCYkWnaowgXirziHj" -> (known after apply)%0A      ~ website_redirect       = "/commands/change-tracking/db-doc.html" -> "/workflows/liquibase-community/automatic-custom-rollbacks.html"%0A        # (4 unchanged attributes hidden)%0A    }%0A%0A  # aws_s3_object.redirects[610] will be created%0A  + resource "aws_s3_object" "redirects" {%0A      + acl                    = "private"%0A      + bucket                 = "stage-docsstageliquibasecom-origin"%0A      + bucket_key_enabled     = (known after apply)%0A      + content_type           = "text/html"%0A      + etag                   = (known after apply)%0A      + force_destroy          = false%0A      + id                     = (known after apply)%0A      + key                    = "/workflows/liquibase-community/generating-docs.html"%0A      + kms_key_id             = (known after apply)%0A      + server_side_encryption = (known after apply)%0A      + storage_class          = (known after apply)%0A      + tags_all               = (known after apply)%0A      + version_id             = (known after apply)%0A      + website_redirect       = "/commands/change-tracking/db-doc.html"%0A    }%0A%0APlan: 2 to add, 0 to change, 1 to destroy.%0A
::debug::stderr: 
::debug::exitcode: 0

```

</details>


*Pusher: @jandroav, Action: `pull_request`, Working Directory: `/home/runner/work/liquibase-docs/liquibase-docs`, Workflow: `Publish Staging Redirects`*